podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/USBDCD0_V1_2_MK28F15.svd.xml
<!--
Devices using this peripheral: 
      MK28F15
      MK82F25615
-->
      <peripheral>
         <?sourceFile "USBDCD0_V1_2_MK28F15" ?>
         <name>USBDCD0</name>
         <description>USB Device Charger Detection module (USB DCD V1.2)</description>
         <groupName>USBDCD</groupName>
         <headerStructName>USBDCD</headerStructName>
         <baseAddress>0x40035000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x1C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CONTROL</name>
               <description>Control Register</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x10000</resetValue>
               <fields>
                  <field>
                     <name>IACK</name>
                     <description>Interrupt Acknowledge</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bX</name>
                           <description>Write 1 to clear IF</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IF</name>
                     <description>Interrupt Flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupt Pending</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupts disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupts enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BC12</name>
                     <description>BC1.2 compatibility level\n This bit cannot be changed after start detection</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Compatible with BC1.1 (default)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Compatible with BC1.2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>START</name>
                     <description>Start Change Detection Sequence</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No effect</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Start sequence\t- Initiate the charger detection sequence. If the sequence is already running, writes of this value have no effect</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SR</name>
                     <description>Software Reset</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No effect</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Software reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLOCK</name>
               <description>Clock Register</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0xC1</resetValue>
               <fields>
                  <field>
                     <name>CLOCK_UNIT</name>
                     <description>Unit of measurement encoding for Clock Speed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>kHz Speed\t- Between 1 kHz and 1023 kHz</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>MHz Speed\t- Between 1 MHz and 1023 MHz</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLOCK_SPEED</name>
                     <description>Numerical Value of Clock Speed in Binary</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status Register</description>
               <addressOffset>0x8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SEQ_RES</name>
                     <description>Charger Detection Sequence Results\nReports how the charger detection is attached</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>No results</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Standard host\t- Must comply with USB Spec 2.0 by drawing only 2.5mA (max) until connected</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Charging port\t- The exact meaning depends on bit 18:\n
\t0: Attached to either a charging host or a dedicated charger. The charger type detection has not completed.\n
\t1: Attached to a charging host. The charger type detection has completed</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Dedicated charger</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEQ_STAT</name>
                     <description>Charger Detection Sequence Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Not enabled/detected\n
The module is either not enabled, or the module is enabled but the data pins have not yet been detected</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Data pin complete</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Charging port complete</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Charger type complete</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ERR</name>
                     <description>Error Flag\nIndicates whether there is an error in the detection sequence</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No sequence errors</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Sequence errors\t- Error in the detection sequence.\n
See the SEQ_STAT field to determine the phase in which the error occurred</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TO</name>
                     <description>Timeout Flag\nIndicates whether the detection sequence has passed the timeout threshhold</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>&lt;= 1 second</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>&gt;= 1 second since contact</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACTIVE</name>
                     <description>Active Status Indicator\nIndicates whether the sequence is running</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Sequence not running</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Sequence running</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SIGNAL_OVERRIDE</name>
               <description>Signal Override Register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>PS</name>
                     <description>Phase Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>No overrides. Bit field must remain at this value during normal USB data communication to prevent unexpected conditions on USB_DP and USB_DM pins. (Default)</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Reserved, not for customer use</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Enables VDP_SRC voltage source for the USB_DP pin and IDM_SINK current source for the USB_DM pin</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved, not for customer use</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMER0</name>
               <description>TIMER0 Register</description>
               <addressOffset>0x10</addressOffset>
               <resetValue>0x100000</resetValue>
               <fields>
                  <field>
                     <name>TUNITCON</name>
                     <description>Unit Connection Timer Elapse (in ms)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TSEQ_INIT</name>
                     <description>Sequence Initiation Time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMER1</name>
               <description>Timing parameters for USBDCD</description>
               <addressOffset>0x14</addressOffset>
               <resetValue>0xA0028</resetValue>
               <fields>
                  <field>
                     <name>TVDPSRC_ON</name>
                     <description>Time Period Comparator Enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>TDCD_DBNC</name>
                     <description>Time Period to Debounce D+ Signal</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMER2_BC11</name>
               <description>Timing parameters for USBDCD v1.1</description>
               <addressOffset>0x18</addressOffset>
               <resetValue>0x280001</resetValue>
               <fields>
                  <field>
                     <name>CHECK_DM</name>
                     <description>Time Before Check of D- Line</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TVDPSRC_CON</name>
                     <description>Time Period Before Enabling D+ Pullup</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMER2_BC12</name>
               <description>Timing parameters for USBDCD v1.2</description>
               <addressOffset>0x18</addressOffset>
               <resetValue>0x10028</resetValue>
               <fields>
                  <field>
                     <name>TVDMSRC_ON</name>
                     <description>Sets the amount of time (in ms) that the module enables the VDM_SRC.\n
Valid values are 0-40ms</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>TWAIT_AFTER_PRD</name>
                     <description>Sets the amount of time (in ms) that the module waits after primary detection before start to secondary detection.\n
Valid values are 1-1023ms. Default is 1ms</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
